{
  "isEquipment": "Async: false\n\nDetermines whether the specified feature is an equipment type.\n\nParameters:\n- `feature` (MywFeature): - The feature to check.\n\nReturns:\n- (Boolean): True if the feature is an equipment type, false otherwise.",
  "fireFeatureEvents": "Async: false\n\nFires events to update the display and other parts of the application when features have changed. <br> This triggers 'featureCollection-modified' events for relevant feature types.\n\nParameters:\n- `aspect` (String): - An aspect describing the context of the update.\n- `type` (String): - Optional. A specific equipment feature type to fire an event for if equipment features are in separate layers.",
  "moveAssembly": "Async: true\n\nMoves an existing equipment feature and all of its children, to a different already-existing housing feature.\n\nParameters:\n- `equip` (MywFeature): - The equipment feature to be moved along with its children.\n- `housing` (MywFeature): - The existing housing feature to which the equipment will be moved.",
  "copyAssembly": "Async: true\n\nCopy an equipment feature, and all of its children, to an already-existing housing feature.\n\nParameters:\n- `equip` (MywFeature): - The equipment feature to be copied along with its children.\n- `housing` (MywFeature): - The existing housing feature to which the equipment will be copied.",
  "connectionsIn": "Async: true\n\nTakes a housing feature and returns an array of all connections of the given housing feature as well as the connections of any contained equipment.\n\nParameters:\n- `housing` (MywFeature): - The housing feature.",
  "connectionsOf": "Async: true\n\nTakes a housing feature and returns an array of its connections.\n\nParameters:\n- `housing` (MywFeature): - The housing feature.",
  "equipmentWithPortInfo": "Async: true\n\nReturns an array of equipment types with port information.\n\nReturns:\n- (Array<String>): array of equipment types.",
  "ripplePortInfo": "Async: true\n\nTakes attribute values from ranges of ports and copies (\"ripples\") those values down or up the circuit.\n\nParameters:\n- `feature` (MywFeature): \n- `direction` (String): - Possible values: 'upstream', 'downstream', or 'both'.\n- `side` (String): - Possible values: 'in' or 'out'.\n- `sourceRanges` (Array<Object>): - An array of pin range objects.\n- `portInfoToRipple` (Array<String>): - An array of port info attribute names with values to be copied."
}